NewsReader/app/views/static_pages/index.html.erb

SELECT "feeds".* FROM "feeds"
---
<script>
  var _feedsJSON = '<%= Feed.all.to_json.html_safe %>';