NewsReader/app/controllers/api/feeds_controller.rb

  def show
    render :json => Feed.find(params[:id]), include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1 ORDER BY "entries"."id" DESC LIMIT 1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]

  def destroy
    feed = Feed.find(params[:id])
    feed.destroy
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 3]]